# GetIntermediateColors Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorSettings..::..GetIntermediateColors Method
AnalysisDisplayColorSettings Class See Also
---
Get intermediate color entries (other than the minimum and maximum settings).
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IList<AnalysisDisplayColorEntry> GetIntermediateColors()
```

Visual Basic
---
```text
Public Function GetIntermediateColors As IList(Of AnalysisDisplayColorEntry)
```

Visual C++
---
```text
public:
IList<AnalysisDisplayColorEntry^>^ GetIntermediateColors()
```

# ### Return Value
Array of intermediate color entries.
# See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace